In [1]:
import pandas as pd
import numpy as np

In [3]:
students_performance = pd.read_csv('https://raw.githubusercontent.com/arturUkr/stepic_inroduction_data_science_machine_learning/master/01_introduction/StudentsPerformance.csv')

In [5]:
students_performance.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [16]:
# students_performance.tail(10)

iloc - integer-location - відбір по "номеру"

In [15]:
# відібрати перші 5 рядків - від 0 до 5, не враховуючи останню позицію. Аналогічно колонки.
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [17]:
# Можна передавати списком рядки та колонки, які необхідно відібрати (останні 3 колонки з кінця)
students_performance.iloc[[0, 3, 10], [-1, -2, -3]]

    writing score  reading score  math score
0              74             72          72
3              44             57          47
10             52             54          58

In [ ]:
# про різницю між loc i iloc --> http://code.sait-dv.ru/2018/10/04/pandas-iloc-vs-ix-vs-loc-obyasnenie/

In [24]:
# возвращает серию с описанием типа каждой колонки
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [27]:
# возвращает коллекцию с индексом всех строк
students_performance.index

RangeIndex(start=0, stop=1000, step=1)

In [28]:
# возвращает серию с числом колонок каждого из типов
students_performance.get_dtype_counts()

int64     3
object    5
dtype: int64

In [31]:
# возвращает часть датафрэйма, куда были включены колонки с типами, указанными в include, 
# или исключены колонки с типами, указанными в exclude
# 
students_performance.select_dtypes(include='int64').head()

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [32]:
students_performance.select_dtypes(exclude='int64').head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none
3,male,group A,associate's degree,free/reduced,none
4,male,group C,some college,standard,none

In [34]:
# возвращает кортеж из числа строк и столбцов у df
students_performance.shape

(1000, 8)

In [35]:
# возвращает число ячеек (число строк, умноженное на число столбцов) в df
students_performance.size

8000

In [38]:
# возвращает коллекцию с названиями колонок
students_performance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')